<a href="https://colab.research.google.com/github/rohit19kumar/CiQ/blob/master/Data_Cleaning_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [43]:
import pandas as pd
import numpy as np

In [44]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [45]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [46]:
df.describe()

       FlightNumber
count           3.0
mean        10065.0
std            20.0
min         10045.0
25%         10055.0
50%         10065.0
75%         10075.0
max         10085.0

In [47]:
df['FlightNumber'].isnull()

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

In [48]:
f=df['FlightNumber']    # incrementing each column of FlightNumber by 10 to previous one thus eliminating NaN
fi=f[0]
flight_num=[fi]
for i in range(1,len(f)):
  fi=fi+10
  flight_num.append(fi)
df['FlightNumber']=flight_num
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [49]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [50]:
df['FlightNumber']=df['FlightNumber'].astype(int)  # changing float datatype to integer data type

In [51]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame

In [52]:
m=df['From_To']
From=[]
To=[]
for i in range(len(m)):
  q=m[i].split('_')
  From.append(q[0])
  To.append(q[1])
df['From']=From
df['To']=To 
df.head()

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN         10055  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [53]:
df.columns

Index(['From_To', 'FlightNumber', 'RecentDelays', 'Airline', 'From', 'To'], dtype='object')

In [54]:
df=df[['From', 'To','From_To', 'FlightNumber', 'RecentDelays', 'Airline']]
df.head()

       From         To  ...  RecentDelays              Airline
0    LoNDon      paris  ...      [23, 47]               KLM(!)
1    MAdrid      miLAN  ...            []    <Air France> (12)
2    londON  StockhOlm  ...  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis  ...          [13]       12. Air France
4  Brussels     londOn  ...      [67, 32]          "Swiss Air"

[5 rows x 6 columns]

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [55]:
df['From']=df['From'].str.title()
df['To']=df['To'].str.title()
df

       From         To  ...  RecentDelays              Airline
0    London      Paris  ...      [23, 47]               KLM(!)
1    Madrid      Milan  ...            []    <Air France> (12)
2    London  Stockholm  ...  [24, 43, 87]  (British Airways. )
3  Budapest      Paris  ...          [13]       12. Air France
4  Brussels     London  ...      [67, 32]          "Swiss Air"

[5 rows x 6 columns]

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [56]:
del df['From_To']

In [57]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [58]:
delay_1= [23,'NaN',24,13,67]
delay_2=[47,'NaN',43,'NaN',32]
delay_3=['NaN','NaN',87,'NaN','NaN']
df['delay_1']=delay_1
df['delay_2']=delay_2
df['delay_3']=delay_3
df

       From         To  FlightNumber  ... delay_1 delay_2 delay_3
0    London      Paris         10045  ...      23      47     NaN
1    Madrid      Milan         10055  ...     NaN     NaN     NaN
2    London  Stockholm         10065  ...      24      43      87
3  Budapest      Paris         10075  ...      13     NaN     NaN
4  Brussels     London         10085  ...      67      32     NaN

[5 rows x 8 columns]

In [59]:
# please tell me the method through which part 5 of the Question I can do with code automatically

In [60]:
df.columns

Index(['From', 'To', 'FlightNumber', 'RecentDelays', 'Airline', 'delay_1',
       'delay_2', 'delay_3'],
      dtype='object')

In [61]:
del df['RecentDelays']
df=df[['From', 'To', 'FlightNumber','delay_1', 'delay_2',
       'delay_3','Airline']]
df

       From         To  FlightNumber  ... delay_2 delay_3              Airline
0    London      Paris         10045  ...      47     NaN               KLM(!)
1    Madrid      Milan         10055  ...     NaN     NaN    <Air France> (12)
2    London  Stockholm         10065  ...      43      87  (British Airways. )
3  Budapest      Paris         10075  ...     NaN     NaN       12. Air France
4  Brussels     London         10085  ...      32     NaN          "Swiss Air"

[5 rows x 7 columns]